Reports/РегламентированныйОтчетСтатистикаПрочиеФормы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Report>
		<Properties>
			<Name>РегламентированныйОтчетСтатистикаПрочиеФормы</Name>
			<Comment>Подготовка данных статистической отчетности на основании выбранного XML-шаблона Росстата</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписи</Name>
					<Comment>Дата подписи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругленияОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочностьЕдиницыИзмерения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/ШаблоныЭВФОтчетовСтатистики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ШаблоныЭВФОтчетовСтатистики</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОКУД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПериодичности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодФормы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Шифр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИмяФайлаШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/РегламентированныйОтчетСтатистикаПрочиеФормы/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

// Хранит таблицу значений - состав показателей отчета.
Перем мТаблицаСоставПоказателей Экспорт;

// Хранит дерево значений - структуру листов отчета.
Перем мДеревоСтраницОтчета Экспорт;

// Хранит признак выбора печатных листов.
Перем мЕстьВыбранные Экспорт;

// Хранит имя выбранной формы отчета
Перем мВыбраннаяФорма Экспорт;

// Хранит признак скопированной формы.
Перем мСкопированаФорма Экспорт;

// Хранит ссылку на документ, хранящий данные отчета
Перем мСохраненныйДок Экспорт;

Перем мПериодичность Экспорт;

// Следующие переменные хранят границы
// периода построения отчета
Перем мДатаНачалаПериодаОтчета Экспорт;
Перем мДатаКонцаПериодаОтчета  Экспорт;

Перем мНарастающимИтогом Экспорт;
Перем мИндексФормыОтчета Экспорт;
Перем мИмяФайлаШаблона Экспорт;

Перем мПолноеИмяФайлаВнешнейОбработки Экспорт;

Перем мЗаписьЗапрещена Экспорт;
Перем мИнтервалАвтосохранения Экспорт;
Перем мРезультатПоиска Экспорт;// таблица с результатами поиска
Перем мСчетчикиСтраницПриПоиске Экспорт;// таблица со счетчиками номеров листов при поиске

Перем мТаблицаФормОтчета Экспорт;
Перем мЗаписываетсяНовыйДокумент Экспорт;
Перем мВариант Экспорт;

Перем мВерсияОтчета Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ТаблицаФормОтчета() Экспорт
	
	ОписаниеТиповДата    = Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	ОписаниеТиповЧисло3  = Новый ОписаниеТипов("Число",    Новый КвалификаторыЧисла(3, 0, ДопустимыйЗнак.Неотрицательный));
	ОписаниеТиповСтрока  = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(0));
	ОписаниеТиповСтрока7 = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(7));
	ОписаниеТиповБулево  = Новый ОписаниеТипов("Булево");
	
	ТаблицаФормОтчета = Новый ТаблицаЗначений;
	ТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",             ОписаниеТиповСтрока);
	ТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",          ОписаниеТиповСтрока, "Утверждена",  20);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия",      ОписаниеТиповДата,   "Действует с", 5);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",       ОписаниеТиповДата,   "         по", 5);
	ТаблицаФормОтчета.Колонки.Добавить("ИндексФормыОтчета",       ОписаниеТиповСтрока);
	ТаблицаФормОтчета.Колонки.Добавить("НаименованиеФормыОтчета", ОписаниеТиповСтрока);
	ТаблицаФормОтчета.Колонки.Добавить("СтрПериодичность",        ОписаниеТиповСтрока);
	ТаблицаФормОтчета.Колонки.Добавить("Периодичность",           ОписаниеТиповЧисло3);
	ТаблицаФормОтчета.Колонки.Добавить("НарастающимИтогом",       ОписаниеТиповБулево);
	ТаблицаФормОтчета.Колонки.Добавить("ОКУД",                    ОписаниеТиповСтрока7);
	ТаблицаФормОтчета.Колонки.Добавить("Версия",                  ОписаниеТиповСтрока);
	ТаблицаФормОтчета.Колонки.Добавить("ИмяФайлаШаблона",         ОписаниеТиповСтрока);
	
	ТаблицаФормОтчета.Индексы.Добавить("ОписаниеОтчета");

	ТаблицаТабельФормСтатистики = ТабельФормСтатистики();
	
	РезультатЗапросаШаблоныЭВФ = ЗапросКРегиструШаблоновЭВФ();
	
	ВыборкаШаблоныЭВФ = РезультатЗапросаШаблоныЭВФ.Выбрать();
	
	Пока ВыборкаШаблоныЭВФ.Следующий() Цикл
		
		НоваяФорма = ТаблицаФормОтчета.Добавить();
		НоваяФорма.ФормаОтчета             = "ФормаОтчета" + "_" + ВыборкаШаблоныЭВФ.КодШаблона;
		НоваяФорма.ОписаниеОтчета          = "Форма " + ВыборкаШаблоныЭВФ.Наименование;
		НоваяФорма.ИндексФормыОтчета       = ВыборкаШаблоныЭВФ.Наименование;
		НоваяФорма.ДатаНачалоДействия      = '20130101';
		НоваяФорма.ДатаКонецДействия       = ОбщегоНазначения.ПустоеЗначениеТипа(Тип("Дата"));
		НоваяФорма.НаименованиеФормыОтчета = ВыборкаШаблоныЭВФ.Наименование;
		НоваяФорма.Периодичность           = ВыборкаШаблоныЭВФ.КодПериодичности;
		НоваяФорма.НарастающимИтогом       = Истина;
		
		ОКУД = Прав("0000000" + ВыборкаШаблоныЭВФ.ОКУД, 7);
		НоваяФорма.ОКУД                    = ОКУД;
		НоваяФорма.Версия                  = ВыборкаШаблоныЭВФ.Версия;
		НоваяФорма.ИмяФайлаШаблона         = ВыборкаШаблоныЭВФ.ИмяФайлаШаблона;
		
		СтрокиТаблицы = ТаблицаТабельФормСтатистики.НайтиСтроки(Новый Структура("ОКУД", ОКУД));
		
		Для каждого СтрокаТаблицы Из СтрокиТаблицы Цикл
			
			Периодичность1 = СтрокаТаблицы.Периодичность % 2; // годовая
			Периодичность2 = СтрокаТаблицы.Периодичность - Периодичность1;
			
			Если ВыборкаШаблоныЭВФ.КодПериодичности = Периодичность1 ИЛИ ВыборкаШаблоныЭВФ.КодПериодичности = Периодичность2 Тогда
				
				НоваяФорма.ИндексФормыОтчета         = СтрокаТаблицы.ИндексФормыОтчета;
				НоваяФорма.НаименованиеФормыОтчета   = СтрокаТаблицы.НаименованиеФормыОтчета; // новое наименование из табеля
				НоваяФорма.СтрПериодичность          = СтрокаТаблицы.СтрПериодичность;
				НоваяФорма.НарастающимИтогом         = СтрокаТаблицы.НарастающимИтогом;
				НоваяФорма.ОписаниеОтчета = "Форма " + СтрокаТаблицы.ИндексФормыОтчета + " """ + СтрокаТаблицы.НаименованиеФормыОтчета + """"
													 + Символы.ПС + СтрокаТаблицы.ОписаниеОтчета + Символы.ПС + СтрокаТаблицы.СтрПериодичность;
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла; 
		
	КонецЦикла;
	
	ТаблицаФормОтчета.Сортировать("ОписаниеОтчета");
	
	Возврат ТаблицаФормОтчета;
	
КонецФункции

Функция ТабельФормСтатистики()
	
	ОписаниеТиповСтрока  = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(0));
	ОписаниеТиповСтрока7 = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(7));
	ОписаниеТиповЧисло3  = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3, 0, ДопустимыйЗнак.Неотрицательный));
	ОписаниеТиповБулево  = Новый ОписаниеТипов("Булево");
	
	ТабФормСтатистики = Новый ТаблицаЗначений;
	ТабФормСтатистики.Колонки.Добавить("ОКУД",                    ОписаниеТиповСтрока7);
	ТабФормСтатистики.Колонки.Добавить("ОписаниеОтчета",          ОписаниеТиповСтрока);
	ТабФормСтатистики.Колонки.Добавить("ИндексФормыОтчета",       ОписаниеТиповСтрока);
	ТабФормСтатистики.Колонки.Добавить("НаименованиеФормыОтчета", ОписаниеТиповСтрока);
	ТабФормСтатистики.Колонки.Добавить("СтрПериодичность",        ОписаниеТиповСтрока);
	ТабФормСтатистики.Колонки.Добавить("Периодичность",           ОписаниеТиповЧисло3);
	ТабФормСтатистики.Колонки.Добавить("НарастающимИтогом",       ОписаниеТиповБулево);

	ТабельФормСтатистики = ПолучитьМакет("ТабельФормСтатистики");
	
	Для Инд = 2 По ТабельФормСтатистики.ВысотаТаблицы Цикл
		
		СтрОКУД              = СокрЛП(ТабельФормСтатистики.Область(Инд, 1).Текст);
		СтрНомерПриказа      = СокрЛП(ТабельФормСтатистики.Область(Инд, 2).Текст);
		СтрДатаПриказа       = СокрЛП(ТабельФормСтатистики.Область(Инд, 3).Текст);
		СтрНаимФормыОтчета   = СокрЛП(ТабельФормСтатистики.Область(Инд, 4).Текст);
		СтрИндексФормыОтчета = СокрЛП(ТабельФормСтатистики.Область(Инд, 5).Текст);
		СтрПериодичность     = СокрЛП(ТабельФормСтатистики.Область(Инд, 6).Текст);
		СтрНарастающимИтогом = СокрЛП(ТабельФормСтатистики.Область(Инд, 10).Текст);

		Если СтрОКУД = "" Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТабФормСтатистики.Добавить();
		НоваяСтрока.ОКУД                    = Прав("0000000" + СтрОКУД, 7);
		НоваяСтрока.ОписаниеОтчета          = "Утверждена приказом Росстата от " + СтрДатаПриказа + " № " + СтрНомерПриказа;
		НоваяСтрока.ИндексФормыОтчета       = СтрИндексФормыОтчета;
		НоваяСтрока.НаименованиеФормыОтчета = СтрНаимФормыОтчета;
		НоваяСтрока.СтрПериодичность        = СтрПериодичность;
		НоваяСтрока.Периодичность           = ПериодичностьИзСтроки(СтрПериодичность);
		НоваяСтрока.НарастающимИтогом       = ЗначениеЗаполнено(СтрНарастающимИтогом);
		
	КонецЦикла;
	
	Возврат ТабФормСтатистики;
	
КонецФункции

Функция ПериодичностьИзСтроки(СтрПериодичность)
	
	СтрокаПериодичность = НРег(СтрПериодичность);
	
	Периодичность = 0;
	
	Если Найти(СтрокаПериодичность, "1 раз") > 0 ИЛИ Найти(СтрокаПериодичность, "годовая") > 0 Тогда
		Периодичность = Периодичность + 1;
	КонецЕсли;
	Если Найти(СтрокаПериодичность, "2 раза") > 0 ИЛИ Найти(СтрокаПериодичность, "полугод") > 0 Тогда
		 Периодичность = Периодичность + 2;
	КонецЕсли;
	Если Найти(СтрокаПериодичность, "квартальная") > 0 Тогда
		 Периодичность = Периодичность + 4;
	КонецЕсли;
	Если Найти(СтрокаПериодичность, "месячная") > 0 Тогда
		 Периодичность = Периодичность + 12;
	КонецЕсли;
	Если Найти(СтрокаПериодичность, "декадная") > 0 Тогда
		 Периодичность = Периодичность + 36;
	КонецЕсли;
	Если Найти(СтрокаПериодичность, "недельная") > 0 Тогда
		 Периодичность = Периодичность + 56;
	КонецЕсли;
	
	Возврат ?(Периодичность = 0, 1, Периодичность);
	
КонецФункции

Функция ЗапросКРегиструШаблоновЭВФ(ИмяФайлаШаблона = Неопределено, СДанными = Ложь) Экспорт
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				   |	ШаблоныЭВФОтчетовСтатистики.ИмяФайлаШаблона,";
	Если СДанными Тогда
		ТекстЗапроса = ТекстЗапроса + "
				   |	ШаблоныЭВФОтчетовСтатистики.Шаблон,";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "
				   |	ШаблоныЭВФОтчетовСтатистики.ОКУД,
				   |	ШаблоныЭВФОтчетовСтатистики.Наименование,
				   |	ШаблоныЭВФОтчетовСтатистики.КодШаблона,
				   |	ШаблоныЭВФОтчетовСтатистики.КодФормы,
				   |	ШаблоныЭВФОтчетовСтатистики.КодПериодичности,
				   |	ШаблоныЭВФОтчетовСтатистики.Шифр,
				   |	ШаблоныЭВФОтчетовСтатистики.Версия
				   |ИЗ
				   |	РегистрСведений.ШаблоныЭВФОтчетовСтатистики КАК ШаблоныЭВФОтчетовСтатистики";

	Запрос = Новый Запрос(ТекстЗапроса);

	Если ИмяФайлаШаблона <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + "
				   |ГДЕ
				   |	ШаблоныЭВФОтчетовСтатистики.ИмяФайлаШаблона ПОДОБНО &ИмяФайлаШаблона
				   |УПОРЯДОЧИТЬ ПО
				   |	ШаблоныЭВФОтчетовСтатистики.Наименование УБЫВ";
		Запрос.УстановитьПараметр("ИмяФайлаШаблона", ИмяФайлаШаблона);
	КонецЕсли;
	
	Возврат Запрос.Выполнить();
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ МОДУЛЯ ОБЪЕКТА

мТаблицаФормОтчета = ТаблицаФормОтчета();
